{
    "interview_questions": [
        "Tell us about yourself.",
        "Why should we hire you?",
        "What accomplishment are you most proud of?",
        "Why do you want to work in this field?",
        "Describe a time you disagreed with a teammate or supervisor.",
        "What are your strengths?",
        "What are your goals?",
        "Why do you want this job?",
        "What are your interests?",
        "Why did you choose your major?",
        "Tell us about a time you failed.",
        "What is a weakness of yours?",
        "Do you have any questions for us?",
        "What specific skill set do you bring to this job?",
        "How do you deal with stressful situations?",
        "What kind of culture are you looking for in a company?",
        "What type of people annoy you?",
        "Tell us about a product you think is well-designed. How would you improve it?",
        "Describe a time when you stepped out of your comfort zone.",
        "Tell us about a time you planned and accomplished a challenging goal.",
        "Describe a time where you had to learn a new skill.",
        "When have you had many tasks to accomplish and a short amount of time to accomplish them?",
        "Do you value creativity or efficiency more?",
        "How do you set priorities or manage time?",
        "Do you prefer to work alone or on a team?",
        "You have 1,000 unread emails in your inbox; whom do you respond to first?",
        "Describe a time you made a successful sale.",
        "In what ways do you think you can make the greatest contributions to our team?",
        "What have you done over the past year for professional development?",
        "What do you bring to our organization that other candidates do not?",
        "What are you passionate about?",
        "How do you stay on top of current knowledge in your field?",
        "What makes an effective team?",
        "What are you currently reading/researching/working on?",
        "What can you contribute/bring to our organization?",
        "What motivates you?",
        "What are your hobbies?",
        "How would previous supervisors describe your work ethic?",
        "What will you do if you don’t get this job/into this program?",
        "How do you define success?",
        "Describe a time you have demonstrated leadership.",
        "Are you applying for other positions/programs?",
        "What questions have we not asked that you wish we would have?",
        "Are you willing to work extra hours? Nights? Weekends? Holidays? Travel for the job?",
        "What would you do if you caught your boss doing something unethical or illegal?",
        "How many basketballs would fit in this room/why are pizzas round? (curveball questions)",
        "Describe a time in which you went above and beyond.",
        "Who has been your favorite boss/coworker?",
        "Who has been your least favorite boss/coworker?",
        "Do you view yourself as overqualified for this position/program?"
    ]
}

